# Для этой таблицы требуется чтобы данные были сопоставленный друг с другом например:
# x 1 3 5
# y 2 4 6
# то есть например если взять две статистики по регионам то у нас для значения х в определенном регионе есть так же значение у
# сортированные Данные для этой таблице следует предевать в виде словаря уникальных элементов а также точно такой же сортированные словарь с частотой появления
# SORTED_DATA_UNIQUE_Y = [146, 408, 437, 762, 772, 812, 818, 951, 981, 995, 1022, 1036, 1063, 1085, 1098, 1100, 1111,
#                1136, 1137, 1150, 1172, 1197, 1206, 1212, 1216, 1222, 1235, 1238, 1242, 1259, 1264, 1266, 1275,
#                1279, 1280, 1287, 1289, 1308, 1324, 1329, 1386, 1456, 1492, 1497, 1510, 1514, 1517, 1519, 1525,
#                1528, 1586, 1595, 1643, 1652, 1662, 1668, 1670, 1693, 1709, 1717, 1760, 1765, 1782, 1791, 1808,
#                1816, 1843, 1848, 1858, 1894, 1901, 1907, 1917, 1942, 1963, 1972, 1973, 2092, 2101, 2132]
#
# SORTED_DATA_UNIQUE_X = [27, 29, 31, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 44, 45, 46, 47, 48, 49, 50,
#                         51, 52, 54, 55, 57, 58, 59, 69, 77, 89, 90, 95, 99, 108, 116, 123]
#
# SORTED_NI_UNIQUE_Y = [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 1, 2, 2, 1, 2, 1, 1, 1,
#                       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 1,
#                       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
#
# SORTED_NI_UNIQUE_X = [2, 3, 3, 2, 4, 5, 5, 5, 1, 5, 6, 6, 1, 3, 4, 4, 2, 1, 2, 1, 2, 2, 1, 2, 2, 1, 1, 1, 1, 1, 1,
#                       2, 2, 1, 1, 1, 1, 1]

SORTED_DATA_UNIQUE_X = [148, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172,
                        173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 190]
SORTED_NI_UNIQUE_X = [1, 1, 2, 2, 1, 3, 3, 6, 6, 9, 15, 15, 8, 14, 10, 15, 15, 11, 12, 9, 6, 6, 10, 1, 4, 3, 3, 2, 1,
                      1, 1, 1, 1, 1, 1]
SORTED_DATA_UNIQUE_Y = [79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 105]
SORTED_NI_UNIQUE_Y = [2, 2, 4, 6, 7, 10, 12, 7, 17, 18, 19, 24, 28, 11, 8, 7, 3, 4, 3, 3, 3, 1, 1]

# print(len(SORTED_DATA_UNIQUE_Y) == len(SORTED_NI_UNIQUE_Y))
# mas = []
# while(True):
#     value= int(input())
#     if(value == 0):
#         break
#     mas.append(value)
# print(mas)
dict_values = {}
dict_ni = {}
for i in range(len(SORTED_DATA_UNIQUE_X)):
    if(i < len(SORTED_DATA_UNIQUE_Y)):
        dict_values[SORTED_DATA_UNIQUE_X[i]] = SORTED_DATA_UNIQUE_Y[i]
    else:
        dict_values[SORTED_DATA_UNIQUE_X[i]] = 0

for i in range(len(SORTED_NI_UNIQUE_X)):
    if(i < len(SORTED_NI_UNIQUE_Y)):
        dict_values[SORTED_NI_UNIQUE_X[i]] = SORTED_NI_UNIQUE_Y[i]
    else:
        dict_values[SORTED_NI_UNIQUE_X[i]] = 0

print(dict_values)
